#Использовать ".."

#Использовать asserts

Перем юТест;

Процедура Инициализация()
    
КонецПроцедуры

Функция ПолучитьСписокТестов(Тестирование) Экспорт
    
    юТест = Тестирование;
    
    СписокТестов = Новый Массив;
    СписокТестов.Добавить("Тест_Должен_СоздатьСсылкиВОписании");
    
    Возврат СписокТестов;
    
КонецФункции

Процедура Тест_Должен_СоздатьСсылкиВОписании() Экспорт
    
    Данные = "Параметр1 - \See ""Другой модуль"" Описание 1 {\link ПарсерМодуля}";

    //РегВыражение = Новый РегулярноеВыражение("{\\link (\S+)}");
    РегВыражение = Новый РегулярноеВыражение("\\See\s+""(\S+)""");
    РегВыражение.ИгнорироватьРегистр = Истина;
    Совпадения = РегВыражение.НайтиСовпадения(Данные);
    Сообщить(Совпадения.Количество());

    Элемент = РегВыражение.Заменить(Данные, "<a href='$0.html'>$0</a>");
    Сообщить(Элемент);

    // Совпадения = РегВыражение.НайтиСовпадения(Данные);
    
    // Для каждого Сп Из Совпадения Цикл

    //     СпГр = Сп.Группы;

    //     СтрДок = СокрЛП(СпГр[1].Значение);

    //     Сообщить(СтрДок);

    

    // КонецЦикла;

КонецПроцедуры

//////////////////////////////////////////////////////////////////////////////////////
// Инициализация

Инициализация();