#Использовать ".."

#Использовать asserts

Перем юТест;

Процедура Инициализация()
	
КонецПроцедуры

Функция ПолучитьСписокТестов(Тестирование) Экспорт
	
	юТест = Тестирование;
	
	СписокТестов = Новый Массив;
	СписокТестов.Добавить("Тест_Должен_ПолучитьМетодыМодуля");
	
	Возврат СписокТестов;
	
КонецФункции

Процедура Тест_Должен_ПолучитьМетодыМодуля() Экспорт

	Парсер = Новый ПарсерИсходниковСиШарп();
	Парсер.УстановитьФайлМодуля("fixtures/testdata.cs");
	Результат = Парсер.ПолучитьМетодыСОписанием();

	// юТест.ПроверитьРавенство(Результат.Количество(), 6);
	
КонецПроцедуры

//////////////////////////////////////////////////////////////////////////////////////
// Инициализация

Инициализация();