Процедура ВыполнитьРегулярку(ИсходнаяСтрока,ТекстРегулярки)
    Сообщить("-----------------------------");
    РегВыражение = Новый РегулярноеВыражение(ТекстРегулярки);
    РегВыражение.ИгнорироватьРегистр = Истина;
    РегВыражение.Многострочный = Истина;
    Совпадения = РегВыражение.НайтиСовпадения(ИсходнаяСтрока);

    Для каждого Сп Из Совпадения Цикл

        СпГр = Сп.Группы;

        Для А = 0 По 20 Цикл
            Если СокрЛ(СокрЛП(СпГр[А].Значение)) <> "" Тогда
                Сообщить("" + А + ": " + СокрЛП(СпГр[А].Значение));
            КонецЕсли;
        КонецЦикла;
    КонецЦикла;
КонецПроцедуры
//-------------------
// ИсходнаяСтрока = "<returns>Неопределено</returns>";
// ТекстРегулярки = "\<returns\>(.*)\<\/returns\>";
// ВыполнитьРегулярку(ИсходнаяСтрока, ТекстРегулярки);

ИсходнаяСтрока = "<param name=""source"">Имя файла-источника</param>";
ТекстРегулярки = "\<param\s+name=\""(.*)\""\>(.*)\<\/param\>";
ВыполнитьРегулярку(ИсходнаяСтрока, ТекстРегулярки);

ИсходнаяСтрока = "
|/// <summary>
|        /// Не используется. Реализован для совместимости API с 1С:Предприятие
|        /// </summary>
|        /// <returns>Неопределено</returns>
|        [ContextProperty(""Параметры"", ""Parameters"")]
|        public IValue Parameters
|        {
|            get
|            {
|               return ValueFactory.Create();
|            }
|            set { }
|        }
|";
ТекстРегулярки = "(.*)(ContextProperty)(\W*|\s*|\S*|.*|(\r\n)*)(get|set)(.*)";
ВыполнитьРегулярку(ИсходнаяСтрока, ТекстРегулярки);

