Функция ВыполнитьТестНаСервере(ИмяТеста)
	Рез = Неопределено;
	ОбъектТест = ВнешниеОтчеты.Создать(Отчет.ФайлаТеста,Ложь);
	Выполнить("Рез = ОбъектТест." + ИмяТеста);

	
	
	Возврат Рез;

КонецфункциИ

&НаКлиенте
Процедура ВыполнитьТест(Команда)

	ТекДанные = Элементы.Тесты.ТекущиеДанные;
	ИмяТеста = ТекДанные.ИмяТеста;

	Элементы.Тесты.ТекущиеДанные.Результат = ВыполнитьТестНаСервере(ИмяТеста);
конецПроцедуры

&НаСервере
Процедура ПолучитьСписокТестов()

	Отчет.Тесты.Очистить();

	ВнешниеОтчеты.Подключить(Отчет.ФайлаТеста);
	ОбъектТест = ВнешниеОтчеты.Создать(Отчет.ФайлаТеста,Ложь);
	
	Тесты = ОбъектТест.ПолучитьСписокТестов();

	Для каждого СтрТест из Тесты цикл
		Стр = Отчет.Тесты.Добавить();
		Стр.Выполнять = Истина;
		Стр.ИмяТеста = СтрТест;
		Стр.Результат = "";
	Конеццикла;

конецПроцедуры

&НаКлиенте
Процедура ПолучитьТесты(Команда)
	ПолучитьСписокТестов();
КонецПроцедуры

&НаСервере
Процедура выполнитьвсетестыНаСервере()

	НачатьТранзакцию();

	Для каждого СтрТест из Отчет.Тесты цикл
		Если СтрТест.Выполнять тогда
			ИмяТеста = СтрТест.ИмяТеста;
			СтрТест.Результат = ВыполнитьТестНаСервере(ИмяТеста);
		конецесли;
	конеццикла;

	ОтменитьТранзакцию();

КонецПроцедуры

&НаКлиенте
Процедура выполнитьвсетесты(Команда)
	выполнитьвсетестыНаСервере();
КонецПроцедуры
