#Использовать ".."
#Использовать asserts

Перем юТест;
Перем Форма;

Процедура Инициализация()
	
КонецПроцедуры

Функция ПолучитьТекстИзФайла(ИмяФайла = "")
    ФайлОбмена = Новый Файл(ИмяФайла);
    Данные = "";
    Если ФайлОбмена.Существует() Тогда
        Текст = Новый ЧтениеТекста(ИмяФайла, КодировкаТекста.UTF8);
        Данные = Текст.Прочитать();
        Текст.Закрыть();
    Иначе
        ВызватьИсключение "Файл не найден: " + ИмяФайла;
    КонецЕсли;
    возврат Данные;
КонецФункции


Функция ПолучитьСписокТестов(Тестирование) Экспорт

	юТест = Тестирование;

	СписокТестов = Новый Массив;
	
	// СписокТестов.Добавить("Тест_Должен_ПолучитьШапкуОтчета");
	// СписокТестов.Добавить("Тест_Должен_ПолучитьФайлСправочника");
	// СписокТестов.Добавить("Тест_Должен_ПолучитьФайлДокумента");
	СписокТестов.Добавить("Тест_Должен_ПолучитьФайлПеречисление");

	Возврат СписокТестов;

КонецФункции

Процедура Тест_Должен_ПолучитьШапкуОтчета() Экспорт
    
    Данные = ПолучитьТекстИзФайла("fixtures\ext-report-1.json");
    
    Параметры = Новый ПарсерJSON;
    Объект = Параметры.ПрочитатьJSON(Данные);


    Генератор = Новый ГенераторXMLФайлов();
	Генератор.СоздатьФайлыПоПравилам(Объект, "fixtures\ext-report-json-xml-cf.xml");

КонецПроцедуры 

Процедура Тест_Должен_ПолучитьФайлСправочника() Экспорт
    
    Данные = ПолучитьТекстИзФайла("fixtures\ref-organisation.json");
    
    Параметры = Новый ПарсерJSON;
    Объект = Параметры.ПрочитатьJSON(Данные);


    Генератор = Новый ГенераторXMLФайлов();
	Генератор.СоздатьФайлыПоПравилам(Объект, "fixtures\Организации.xml");

КонецПроцедуры 

Процедура Тест_Должен_ПолучитьФайлДокумента() Экспорт
    
    Данные = ПолучитьТекстИзФайла("fixtures\doc-document1.json");
    
    Параметры = Новый ПарсерJSON;
    Объект = Параметры.ПрочитатьJSON(Данные);


    Генератор = Новый ГенераторXMLФайлов();
	Генератор.СоздатьФайлыПоПравилам(Объект, "fixtures\Документ1.xml");

КонецПроцедуры 

Процедура Тест_Должен_ПолучитьФайлПеречисление() Экспорт
    
    Данные = ПолучитьТекстИзФайла("fixtures\enum-enum1.json");
    
    Параметры = Новый ПарсерJSON;
    Объект = Параметры.ПрочитатьJSON(Данные);


    Генератор = Новый ГенераторXMLФайлов();
	Генератор.СоздатьФайлыПоПравилам(Объект, "fixtures\Перечисление1.xml");

КонецПроцедуры 


//////////////////////////////////////////////////////////////////////////////////////
// Инициализация

Инициализация();
