#Использовать ".."

#Использовать asserts

Перем юТест;

Процедура Инициализация()
    
КонецПроцедуры

Функция ПолучитьСписокТестов(Тестирование) Экспорт
    
    юТест = Тестирование;
    
    СписокТестов = Новый Массив;
     СписокТестов.Добавить("Тест_Должен_СоздатьФайлMarkdown");
     СписокТестов.Добавить("Тест_Должен_СоздатьФайлMarkdownДляПарсера");
    
    Возврат СписокТестов;
    
КонецФункции

Процедура Тест_Должен_СоздатьФайлMarkdown() Экспорт

    Генератор = Новый ГенераторMarkdown;
    Файл = Новый Файл("fixtures/module.os");
    Генератор.СоздатьДокумент(Файл.ПолноеИмя, "fixtures/module.md", Ложь);
    
КонецПроцедуры

Процедура Тест_Должен_СоздатьФайлMarkdownДляПарсера() Экспорт
    Генератор = Новый ГенераторMarkdown;
    Файл = Новый Файл("src/moduleparser.os");
    Генератор.СоздатьДокумент(Файл.ПолноеИмя, "fixtures/moduleparser.md", Ложь);
КонецПроцедуры

//////////////////////////////////////////////////////////////////////////////////////
// Инициализация

Инициализация();