#Использовать ".."

#Использовать asserts
#Использовать json

Перем юТест;

Процедура Инициализация()
	
КонецПроцедуры

Функция ПолучитьСписокТестов(Тестирование) Экспорт
	
	юТест = Тестирование;
	
	СписокТестов = Новый Массив;
	СписокТестов.Добавить("Тест_Должен_ПолучитьОписаниеМодуля");
	СписокТестов.Добавить("Тест_Должен_ПолучитьМетодыМодуля");
	СписокТестов.Добавить("Тест_Должен_ПолучитьМетодыМодуля2");
	
	Возврат СписокТестов;
	
КонецФункции

Процедура Тест_Должен_ПолучитьОписаниеМодуля() Экспорт

	Парсер = Новый ПарсерМодуля;
	Парсер.УстановитьФайлМодуля("src/moduleparser.os");
	Результат = Парсер.ПолучитьОписание();

	юТест.ПроверитьРавенство(Результат.Автор, "ret-Phoenix");
	юТест.ПроверитьРавенство(Результат.Имя, "ПарсерМодуля");
	
КонецПроцедуры

Процедура Тест_Должен_ПолучитьМетодыМодуля() Экспорт

	Парсер = Новый ПарсерМодуля;
	Парсер.УстановитьФайлМодуля("src/moduleparser.os");
	Результат = Парсер.ПолучитьМетодыСОписанием();

	юТест.ПроверитьРавенство(Результат.Количество(), 6);
	
КонецПроцедуры

Процедура Тест_Должен_ПолучитьМетодыМодуля2() Экспорт

	Парсер = Новый ПарсерМодуля;
	Парсер.УстановитьФайлМодуля("fixtures/module.os");
	Результат = Парсер.ПолучитьМетодыСОписанием();

	МетодыДляПроверки = ",МойМетод,МояПроцедура2,МояФункция,ПроцБезПараметров,ФункцияБезАннотаций"
	+ ",ДобавитьСообщениеДляЖурналаРегистрации,ОткрытьЖурналРегистрации,ОткрытьДанныеДляПросмотра"
	+",ПросмотрТекущегоСобытияВОтдельномОкне,УстановитьИнтервалДатДляПросмотра,СобытияВыбор"
	+",УстановитьОтборПоЗначениюВТекущейКолонке,СобытиеЖурналаРегистрацииВСтруктуру";

	Методы = "";	
	Для каждого Метод Из Результат Цикл
		Методы = Методы + "," + Метод.Имя;
	КонецЦикла;

	юТест.ПроверитьРавенство(Результат.Количество(), 13);
	юТест.ПроверитьРавенство(Методы, МетодыДляПроверки);
	юТест.ПроверитьРавенство(Результат[4].Параметры, Неопределено);
	юТест.ПроверитьРавенство(Результат[4].Экспорт, Истина);
	юТест.ПроверитьРавенство(Результат[3].Экспорт, Ложь);
	
КонецПроцедуры

//////////////////////////////////////////////////////////////////////////////////////
// Инициализация

Инициализация();