#Использовать ".."

#Использовать asserts

Перем юТест;

Процедура Инициализация()
	
КонецПроцедуры

Функция ПолучитьСписокТестов(Тестирование) Экспорт
	
	юТест = Тестирование;
	
	СписокТестов = Новый Массив;
	 СписокТестов.Добавить("Тест_Должен_СоздатьФайлMarkdown");
	
	Возврат СписокТестов;
	
КонецФункции

Процедура Тест_Должен_СоздатьФайлMarkdown() Экспорт

	Генератор = Новый ГенераторMarkdown;
    //Файл = Новый Файл("src/moduleparser.os");
    Файл = Новый Файл("tests/module.os");
    // Сообщить("Полное: " +Файл.ПолноеИмя);
	Генератор.СоздатьДокумент(Файл.ПолноеИмя, "tests/moduleparser.md", Ложь);
	
КонецПроцедуры


//////////////////////////////////////////////////////////////////////////////////////
// Инициализация

Инициализация();